{"posted": ["Nifty bulls in panic mode. Peter Lynch's 4 rules for surviving market mayhem", "Prepping for War With Russia on the Ice and Snow", "DGTR recommends countervailing duty on copper wire imports", "In U.S.- China Tariffs Standoff, Trump Showed Xi He Has Limits", "For Taiwan’s Small Exporters, the Uncertainty’s as Bad as the Tariffs", "India inflation in March likely steady after four months of decline: Reuters poll", "Dalal Street ends week on strong note as fear ebbs", "Sebi bats for ‘optimal regulation,’ likely to revamp norms", "Vegetable oil import down 16 per cent in March to 9.98 lakh tonne: SEA", "Why Iran’s Supreme Leader Came Around to Nuclear Talks With Trump", "Repo rate could be headed to 5.25-5.5% amid growth fears, global uncertainties", "Stocks Post Gains, but Bond Market Signals Investors Are Anxious", "Buy Hatsun Agro Products; target of Rs 1190: ICICI Securities", "TCS’ strong deal momentum a counter to short-term worries", "Buy City Union Bank; target of Rs 170: ICICI Securities", "Steeling China for a Tariff Fight, Xi Faces His Biggest Test Since Covid", "Sell Indus Tower; target of Rs 260: ICICI Securities", "Portfolio strategy now needs rebalancing; avoid chasing froth: Jigar Mistry", "Buy Navneet Education; target of Rs 182: Prabhudas Lilladher", "Buy Jindal Drilling and Industries; target of Rs 960: Anand Rathi", "Accumulate Infosys; target of Rs 1531: KR Choksey", "Is D-Street in the 8-year cycle of modest returns?", "Live Updates: U.S. Bond Yields Spike as Tariff Turmoil Spooks Investors", "Buy Patel Engineering; target of Rs 80: ICICI Direct", "Biocon shares rally nearly 6% after unit receives USFDA nod for cancer drug", "Buy HDFC Life Insurance Company; target of Rs 739: ICICI Securities", "Reduce Wipro; target of Rs 410: ICICI Securities", "Reduce Aditya Birla Fashion and Retail; target of Rs 230: Emkay Global Financial", "Reduce Persistent Systems; target of Rs 3700: Emkay Global Financial", "Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial", "Muthoot Finance shares fall 14% in two-day rout on RBI tightening gold loan rules", "Buy Tejas Networks; target of Rs 1100: Emkay Global Financial", "Live Updates: China Raises Tariffs on U.S. to 125% as Tit-For-Tat Trade War Escalates", "Buy HDFC Bank; target of Rs 1,850: ICICI Securities"]}